MYiR-Dev/myir-imx-linux/drivers/staging/rtl8733bu/core/rtw_rf.c
/******************************************************************************
 *
 * Copyright(c) 2007 - 2017 Realtek Corporation.
 *
 * This program is free software; you can redistribute it and/or modify it
 * under the terms of version 2 of the GNU General Public License as
 * published by the Free Software Foundation.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for
 * more details.
 *
 *****************************************************************************/
#define _RTW_RF_C_

#include <drv_types.h>
#include <hal_data.h>

u8 center_ch_2g[CENTER_CH_2G_NUM] = {
/* G00 */1, 2,
/* G01 */3, 4, 5,
/* G02 */6, 7, 8,
/* G03 */9, 10, 11,
/* G04 */12, 13,
/* G05 */14
};

#define ch_to_cch_2g_idx(ch) ((ch) - 1)

u8 center_ch_2g_40m[CENTER_CH_2G_40M_NUM] = {
	3,
	4,
	5,
	6,
	7,
	8,
	9,
	10,
	11,
};

u8 op_chs_of_cch_2g_40m[CENTER_CH_2G_40M_NUM][2] = {
	{1, 5}, /* 3 */
	{2, 6}, /* 4 */
	{3, 7}, /* 5 */
	{4, 8}, /* 6 */
	{5, 9}, /* 7 */
	{6, 10}, /* 8 */
	{7, 11}, /* 9 */
	{8, 12}, /* 10 */
	{9, 13}, /* 11 */
};

#if CONFIG_IEEE80211_BAND_5GHZ
u8 center_ch_5g_all[CENTER_CH_5G_ALL_NUM] = {
/* G00 */36, 38, 40,
	42,
/* G01 */44, 46, 48,
	/* 50, */
/* G02 */52, 54, 56,
	58,
/* G03 */60, 62, 64,
/* G04 */100, 102, 104,
	106,
/* G05 */108, 110, 112,
	/* 114, */
/* G06 */116, 118, 120,
	122,
/* G07 */124, 126, 128,
/* G08 */132, 134, 136,
	138,
/* G09 */140, 142, 144,
/* G10 */149, 151, 153,
	155,
/* G11 */157, 159, 161,
	/* 163, */
/* G12 */165, 167, 169,
	171,
/* G13 */173, 175, 177
};

u8 center_ch_5g_20m[CENTER_CH_5G_20M_NUM] = {
/* G00 */36, 40,
/* G01 */44, 48,
/* G02 */52, 56,
/* G03 */60, 64,
/* G04 */100, 104,
/* G05 */108, 112,
/* G06 */116, 120,
/* G07 */124, 128,
/* G08 */132, 136,
/* G09 */140, 144,
/* G10 */149, 153,
/* G11 */157, 161,
/* G12 */165, 169,
/* G13 */173, 177
};

#define ch_to_cch_5g_20m_idx(ch) \
	( \
		((ch) >= 36 && (ch) <= 64) ? (((ch) - 36) >> 2) : \
		((ch) >= 100 && (ch) <= 144) ? 8 + (((ch) - 100) >> 2) : \
		((ch) >= 149 && (ch) <= 177) ? 20 + (((ch) - 149) >> 2) : 255 \
	)

u8 center_ch_5g_40m[CENTER_CH_5G_40M_NUM] = {
/* G00 */38,
/* G01 */46,
/* G02 */54,
/* G03 */62,
/* G04 */102,
/* G05 */110,
/* G06 */118,
/* G07 */126,
/* G08 */134,
/* G09 */142,
/* G10 */151,
/* G11 */159,
/* G12 */167,
/* G13 */175
};

u8 op_chs_of_cch_5g_40m[CENTER_CH_5G_40M_NUM][2] = {
	{36, 40}, /* 38 */
	{44, 48}, /* 46 */
	{52, 56}, /* 54 */
	{60, 64}, /* 62 */
	{100, 104}, /* 102 */
	{108, 112}, /* 110 */
	{116, 120}, /* 118 */
	{124, 128}, /* 126 */
	{132, 136}, /* 134 */
	{140, 144}, /* 142 */
	{149, 153}, /* 151 */
	{157, 161}, /* 159 */
	{165, 169}, /* 167 */
	{173, 177}, /* 175 */
};

u8 center_ch_5g_80m[CENTER_CH_5G_80M_NUM] = {
/* G00 ~ G01*/42,
/* G02 ~ G03*/58,
/* G04 ~ G05*/106,
/* G06 ~ G07*/122,
/* G08 ~ G09*/138,
/* G10 ~ G11*/155,
/* G12 ~ G13*/171
};

u8 op_chs_of_cch_5g_80m[CENTER_CH_5G_80M_NUM][4] = {
	{36, 40, 44, 48}, /* 42 */
	{52, 56, 60, 64}, /* 58 */
	{100, 104, 108, 112}, /* 106 */
	{116, 120, 124, 128}, /* 122 */
	{132, 136, 140, 144}, /* 138 */
	{149, 153, 157, 161}, /* 155 */
	{165, 169, 173, 177}, /* 171 */
};

u8 center_ch_5g_160m[CENTER_CH_5G_160M_NUM] = {
/* G00 ~ G03*/50,
/* G04 ~ G07*/114,
/* G10 ~ G13*/163
};

u8 op_chs_of_cch_5g_160m[CENTER_CH_5G_160M_NUM][8] = {
	{36, 40, 44, 48, 52, 56, 60, 64}, /* 50 */
	{100, 104, 108, 112, 116, 120, 124, 128}, /* 114 */
	{149, 153, 157, 161, 165, 169, 173, 177}, /* 163 */
};
#endif /* CONFIG_IEEE80211_BAND_5GHZ */

#if CONFIG_IEEE80211_BAND_6GHZ
u8 center_ch_6g_20m[CENTER_CH_6G_20M_NUM] = {
	1, 5, 9, 13, 17, 21, 25, 29,
	33, 37, 41, 45, 49, 53, 57, 61,
	65, 69, 73, 77, 81, 85, 89, 93,
	97, 101, 105, 109, 113, 117, 121, 125,
	129, 133, 137, 141, 145, 149, 153, 157,
	161, 165, 169, 173, 177, 181, 185, 189,
	193, 197, 201, 205, 209, 213, 217, 221,
	225, 229, 233, 237, 241, 245, 249, 253,
};

u8 center_ch_6g_40m[CENTER_CH_6G_40M_NUM] = {
	3, 11, 19, 27,
	35, 43, 51, 59,
	67, 75, 83, 91,
	99, 107, 115, 123,
	131, 139, 147, 155,
	163, 171, 179, 187,
	195, 203, 211, 219,
	227, 235, 243, 251,
};

u8 op_chs_of_cch_6g_40m[CENTER_CH_6G_40M_NUM][2] = {
	{1, 5}, /* 3 */
	{9, 13}, /* 11 */
	{17, 21}, /* 19 */
	{25, 29}, /* 27 */
	{33, 37}, /* 35 */
	{41, 45}, /* 43 */
	{49, 53}, /* 51 */
	{57, 61}, /* 59 */
	{65, 69}, /* 67 */
	{73, 77}, /* 75 */
	{81, 85}, /* 83 */
	{89, 93}, /* 91 */
	{97, 101}, /* 99 */
	{105, 109}, /* 107 */
	{113, 117}, /* 115 */
	{121, 125}, /* 123 */
	{129, 133}, /* 131 */
	{137, 141}, /* 139 */
	{145, 149}, /* 147 */
	{153, 157}, /* 155 */
	{161, 165}, /* 163 */
	{169, 173}, /* 171 */
	{177, 181}, /* 179 */
	{185, 189}, /* 187 */
	{193, 197}, /* 195 */
	{201, 205}, /* 203 */
	{209, 213}, /* 211 */
	{217, 221}, /* 219 */
	{225, 229}, /* 227 */
	{233, 237}, /* 235 */
	{241, 245}, /* 243 */
	{249, 253}, /* 251 */
};

u8 center_ch_6g_80m[CENTER_CH_6G_80M_NUM] = {
	7, 23,
	39, 55,
	71, 87,
	103, 119,
	135, 151,
	167, 183,
	199, 215,
	231, 247,
};

u8 op_chs_of_cch_6g_80m[CENTER_CH_6G_80M_NUM][4] = {
	{1, 5, 9, 13}, /* 7 */
	{17, 21, 25, 29}, /* 23 */
	{33, 37, 41, 45}, /* 39 */
	{49, 53, 57, 61}, /* 55 */
	{65, 69, 73, 77}, /* 71 */
	{81, 85, 89, 93}, /* 87 */
	{97, 101, 105, 109}, /* 103 */
	{113, 117, 121, 125}, /* 119 */
	{129, 133, 137, 141}, /* 135 */
	{145, 149, 153, 157}, /* 151 */
	{161, 165, 169, 173}, /* 167 */
	{177, 181, 185, 189}, /* 183 */
	{193, 197, 201, 205}, /* 199 */
	{209, 213, 217, 221}, /* 215 */
	{225, 229, 233, 237}, /* 231 */
	{241, 245, 249, 253}, /* 247 */
};

u8 center_ch_6g_160m[CENTER_CH_6G_160M_NUM] = {
	15,
	47,
	79,
	111,
	143,
	175,
	207,
	239,
};

u8 op_chs_of_cch_6g_160m[CENTER_CH_6G_160M_NUM][8] = {
	{1, 5, 9, 13, 17, 21, 25, 29}, /* 15 */
	{33, 37, 41, 45, 49, 53, 57, 61}, /* 47 */
	{65, 69, 73, 77, 81, 85, 89, 93}, /* 79 */
	{97, 101, 105, 109, 113, 117, 121, 125}, /* 111 */
	{129, 133, 137, 141, 145, 149, 153, 157}, /* 143 */
	{161, 165, 169, 173, 177, 181, 185, 189}, /* 175 */
	{193, 197, 201, 205, 209, 213, 217, 221}, /* 207 */
	{225, 229, 233, 237, 241, 245, 249, 253}, /* 239 */
};
#endif /* CONFIG_IEEE80211_BAND_6GHZ */

struct center_chs_ent_t {
	u8 ch_num;
	u8 *chs;
};

struct center_chs_ent_t center_chs_2g_by_bw[] = {
	{CENTER_CH_2G_NUM, center_ch_2g},
	{CENTER_CH_2G_40M_NUM, center_ch_2g_40m},
};

#if CONFIG_IEEE80211_BAND_5GHZ
struct center_chs_ent_t center_chs_5g_by_bw[] = {
	{CENTER_CH_5G_20M_NUM, center_ch_5g_20m},
	{CENTER_CH_5G_40M_NUM, center_ch_5g_40m},
	{CENTER_CH_5G_80M_NUM, center_ch_5g_80m},
	{CENTER_CH_5G_160M_NUM, center_ch_5g_160m},
};
#endif

