MYiR-Dev/myir-imx-linux/drivers/staging/rtl8733bu/core/rtw_rf.c
#if CONFIG_IEEE80211_BAND_6GHZ
struct center_chs_ent_t center_chs_6g_by_bw[] = {
	{CENTER_CH_6G_20M_NUM, center_ch_6g_20m},
	{CENTER_CH_6G_40M_NUM, center_ch_6g_40m},
	{CENTER_CH_6G_80M_NUM, center_ch_6g_80m},
	{CENTER_CH_6G_160M_NUM, center_ch_6g_160m},
};
#endif

/*
 * Get center channel of smaller bandwidth by @param band, @param cch, @param bw, @param offset
 * @band: the given band
 * @cch: the given center channel
 * @bw: the given bandwidth
 * @offset: the given primary SC offset of the given bandwidth
 *
 * return center channel of smaller bandiwdth if valid, or 0
 */
static u8 _rtw_get_scch_by_bcch_offset(enum band_type band, u8 cch, u8 bw, u8 offset)
{
	u8 t_cch = 0;

	if (bw == CHANNEL_WIDTH_20) {
		t_cch = cch;
		goto exit;
	}

	if (offset == CHAN_OFFSET_NO_EXT) {
		rtw_warn_on(1);
		goto exit;
	}

	if (band == BAND_ON_24G) {
		/* 2.4G, 40MHz */
		if (cch >= 3 && cch <= 11 && bw == CHANNEL_WIDTH_40) {
			t_cch = (offset == CHAN_OFFSET_LOWER) ? cch + 2 : cch - 2;
			goto exit;
		}
	}

#if CONFIG_IEEE80211_BAND_5GHZ
	else if (band == BAND_ON_5G) {
		/* 5G, 160MHz */
		if (cch >= 50 && cch <= 163 && bw == CHANNEL_WIDTH_160) {
			t_cch = (offset == CHAN_OFFSET_LOWER) ? cch + 8 : cch - 8;
			goto exit;

		/* 5G, 80MHz */
		} else if (cch >= 42 && cch <= 171 && bw == CHANNEL_WIDTH_80) {
			t_cch = (offset == CHAN_OFFSET_LOWER) ? cch + 4 : cch - 4;
			goto exit;

		/* 5G, 40MHz */
		} else if (cch >= 38 && cch <= 175 && bw == CHANNEL_WIDTH_40) {
			t_cch = (offset == CHAN_OFFSET_LOWER) ? cch + 2 : cch - 2;
			goto exit;

		}
	}
#endif

#if CONFIG_IEEE80211_BAND_6GHZ
	else if (band == BAND_ON_6G) {
		/* 6G, 160MHz */
		if (cch >= 15 && cch <= 239 && bw == CHANNEL_WIDTH_160) {
			t_cch = (offset == CHAN_OFFSET_LOWER) ? cch + 8 : cch - 8;
			goto exit;

		/* 6G, 80MHz */
		} else if (cch >= 7 && cch <= 247 && bw == CHANNEL_WIDTH_80) {
			t_cch = (offset == CHAN_OFFSET_LOWER) ? cch + 4 : cch - 4;
			goto exit;

		/* 6G, 40MHz */
		} else if (cch >= 3 && cch <= 251 && bw == CHANNEL_WIDTH_40) {
			t_cch = (offset == CHAN_OFFSET_LOWER) ? cch + 2 : cch - 2;
			goto exit;

		}
	}
#endif

	rtw_warn_on(1);

exit:
	return t_cch;
}

#if CONFIG_ALLOW_FUNC_2G_5G_ONLY
RTW_FUNC_2G_5G_ONLY u8 rtw_get_scch_by_cch_offset(u8 cch, u8 bw, u8 offset)
{
	return _rtw_get_scch_by_bcch_offset(rtw_is_2g_ch(cch) ? BAND_ON_24G : BAND_ON_5G, cch, bw, offset);
}

RTW_FUNC_2G_5G_ONLY u8 rtw_get_scch_by_cch_opch(u8 cch, u8 bw, u8 opch)
{
	u8 offset = CHAN_OFFSET_NO_EXT;

	if (opch > cch)
		offset = CHAN_OFFSET_LOWER;
	else if (opch < cch)
		offset = CHAN_OFFSET_UPPER;

	return rtw_get_scch_by_cch_offset(cch, bw, offset);
}
#endif

u8 rtw_get_scch_by_bcch_offset(enum band_type band, u8 cch, u8 bw, u8 offset)
{
	return _rtw_get_scch_by_bcch_offset(band, cch, bw, offset);
}

/*
 * Get center channel of smaller bandwidth by @param band, @param cch, @param bw, @param opch
 * @band: the given band
 * @cch: the given center channel
 * @bw: the given bandwidth
 * @opch: the given operating channel
 *
 * return center channel of smaller bandiwdth if valid, or 0
 */
u8 rtw_get_scch_by_bcch_opch(enum band_type band, u8 cch, u8 bw, u8 opch)
{
	u8 offset = CHAN_OFFSET_NO_EXT;

	if (opch > cch)
		offset = CHAN_OFFSET_LOWER;
	else if (opch < cch)
		offset = CHAN_OFFSET_UPPER;

	return rtw_get_scch_by_bcch_offset(band, cch, bw, offset);
}

struct op_chs_ent_t {
	u8 ch_num;
	u8 *chs;
};

struct op_chs_ent_t op_chs_of_cch_2g_by_bw[] = {
	{1, center_ch_2g},
	{2, (u8 *)op_chs_of_cch_2g_40m},
};

#if CONFIG_IEEE80211_BAND_5GHZ
struct op_chs_ent_t op_chs_of_cch_5g_by_bw[] = {
	{1, center_ch_5g_20m},
	{2, (u8 *)op_chs_of_cch_5g_40m},
	{4, (u8 *)op_chs_of_cch_5g_80m},
	{8, (u8 *)op_chs_of_cch_5g_160m},
};
#endif

#if CONFIG_IEEE80211_BAND_6GHZ
struct op_chs_ent_t op_chs_of_cch_6g_by_bw[] = {
	{1, center_ch_6g_20m},
	{2, (u8 *)op_chs_of_cch_6g_40m},
	{4, (u8 *)op_chs_of_cch_6g_80m},
	{8, (u8 *)op_chs_of_cch_6g_160m},
};
#endif

u8 center_chs_2g_num(u8 bw)
{
	if (bw > CHANNEL_WIDTH_40)
		return 0;

	return center_chs_2g_by_bw[bw].ch_num;
}

u8 center_chs_2g(u8 bw, u8 id)
{
	if (bw > CHANNEL_WIDTH_40)
		return 0;

	if (id >= center_chs_2g_num(bw))
		return 0;

	return center_chs_2g_by_bw[bw].chs[id];
}

#if CONFIG_IEEE80211_BAND_5GHZ
u8 center_chs_5g_num(u8 bw)
{
	if (bw > CHANNEL_WIDTH_160)
		return 0;

	return center_chs_5g_by_bw[bw].ch_num;
}

u8 center_chs_5g(u8 bw, u8 id)
{
	if (bw > CHANNEL_WIDTH_160)
		return 0;

	if (id >= center_chs_5g_num(bw))
		return 0;

	return center_chs_5g_by_bw[bw].chs[id];
}
#endif /* CONFIG_IEEE80211_BAND_5GHZ */

#if CONFIG_IEEE80211_BAND_6GHZ
u8 center_chs_6g_num(u8 bw)
{
	if (bw > CHANNEL_WIDTH_160)
		return 0;

	return center_chs_6g_by_bw[bw].ch_num;
}

u8 center_chs_6g(u8 bw, u8 id)
{
	if (bw > CHANNEL_WIDTH_160)
		return 0;

	if (id >= center_chs_6g_num(bw))
		return 0;

	return center_chs_6g_by_bw[bw].chs[id];
}
#endif /* CONFIG_IEEE80211_BAND_6GHZ */

u8 (*center_chs_num_of_band[BAND_MAX])(u8 bw) = {
	[BAND_ON_24G] = center_chs_2g_num,
#if CONFIG_IEEE80211_BAND_5GHZ
	[BAND_ON_5G] = center_chs_5g_num,
#endif
#if CONFIG_IEEE80211_BAND_6GHZ
	[BAND_ON_6G] = center_chs_6g_num,
#endif
};

u8 (*center_chs_of_band[BAND_MAX])(u8 bw, u8 id) = {
	[BAND_ON_24G] = center_chs_2g,
#if CONFIG_IEEE80211_BAND_5GHZ
	[BAND_ON_5G] = center_chs_5g,
#endif
#if CONFIG_IEEE80211_BAND_6GHZ
	[BAND_ON_6G] = center_chs_6g,
#endif
};

/*
 * Get available op channels by @param cch, @param bw
 * @cch: the given center channel
 * @bw: the given bandwidth
 * @op_chs: the pointer to return pointer of op channel array
 * @op_ch_num: the pointer to return pointer of op channel number
 *
 * return valid (1) or not (0)
 */
static u8 _rtw_get_op_chs_by_bcch_bw(enum band_type band, u8 cch, u8 bw, u8 **op_chs, u8 *op_ch_num)
{
	int i;
	struct center_chs_ent_t *c_chs_ent = NULL;
	struct op_chs_ent_t *op_chs_ent = NULL;
	u8 valid = 1;

	if (band == BAND_ON_24G
		&& bw <= CHANNEL_WIDTH_40
	) {
		c_chs_ent = &center_chs_2g_by_bw[bw];
		op_chs_ent = &op_chs_of_cch_2g_by_bw[bw];

#if CONFIG_IEEE80211_BAND_5GHZ
	} else if (band == BAND_ON_5G
		&& bw <= CHANNEL_WIDTH_160
	) {
		c_chs_ent = &center_chs_5g_by_bw[bw];
		op_chs_ent = &op_chs_of_cch_5g_by_bw[bw];
#endif

