MYiR-Dev/myir-imx-linux/drivers/staging/rtl8733bu/core/rtw_rf.c
#if CONFIG_IEEE80211_BAND_6GHZ
	} else if (band == BAND_ON_6G
		&& bw <= CHANNEL_WIDTH_160
	) {
		c_chs_ent = &center_chs_6g_by_bw[bw];
		op_chs_ent = &op_chs_of_cch_6g_by_bw[bw];
#endif

	} else {
		valid = 0;
		goto exit;
	}

	for (i = 0; i < c_chs_ent->ch_num; i++)
		if (cch == *(c_chs_ent->chs + i))
			break;

	if (i == c_chs_ent->ch_num) {
		valid = 0;
		goto exit;
	}

	*op_chs = op_chs_ent->chs + op_chs_ent->ch_num * i;
	*op_ch_num = op_chs_ent->ch_num;

exit:
	return valid;
}

#if CONFIG_ALLOW_FUNC_2G_5G_ONLY
RTW_FUNC_2G_5G_ONLY u8 rtw_get_op_chs_by_cch_bw(u8 cch, u8 bw, u8 **op_chs, u8 *op_ch_num)
{
	return _rtw_get_op_chs_by_bcch_bw(rtw_is_2g_ch(cch) ? BAND_ON_24G : BAND_ON_5G, cch, bw, op_chs, op_ch_num);
}
#endif

u8 rtw_get_op_chs_by_bcch_bw(enum band_type band, u8 cch, u8 bw, u8 **op_chs, u8 *op_ch_num)
{
	return _rtw_get_op_chs_by_bcch_bw(band, cch, bw, op_chs, op_ch_num);
}

static u8 rtw_get_offsets_by_chbw_2g(u8 ch, u8 bw, u8 *r_offset, u8 *r_offset_num)
{
	u8 valid = 1;
	u8 offset[2] = {CHAN_OFFSET_NO_EXT, CHAN_OFFSET_NO_EXT};
	u8 offset_num = 1;

	if (bw >= CHANNEL_WIDTH_80
		|| ch < 1 || ch > 14
	) {
		valid = 0;
		goto exit;
	}

	if (bw == CHANNEL_WIDTH_20)
		goto exit;

	if (ch >= 1 && ch <= 4)
		offset[0] = CHAN_OFFSET_UPPER;
	else if (ch >= 5 && ch <= 9) {
		if (!r_offset_num) {
			/* return single offset */
			if (r_offset && (*r_offset == CHAN_OFFSET_UPPER || *r_offset == CHAN_OFFSET_LOWER))
				offset[0] = *r_offset; /* both lower and upper is valid, obey input value */
			else
				offset[0] = CHAN_OFFSET_LOWER; /* default use primary upper */
		} else {
			offset_num = 2;
			offset[0] = CHAN_OFFSET_LOWER;
			offset[1] = CHAN_OFFSET_UPPER;
		}
	} else if (ch >= 10 && ch <= 13)
		offset[0] = CHAN_OFFSET_LOWER;
	else {
		valid = 0; /* ch14 doesn't support 40MHz bandwidth */
		goto exit;
	}

exit:
	if (valid) {
		if (r_offset) {
			*r_offset = offset[0];
			if (offset_num == 2)
				*(r_offset + 1) = offset[1];
		}
		if (r_offset_num)
			*r_offset_num = offset_num;
	}
	return valid;
}

#if CONFIG_IEEE80211_BAND_5GHZ
static u8 rtw_get_offset_by_chbw_5g(u8 ch, u8 bw, u8 *r_offset)
{
	u8 valid = 1;
	u8 offset = CHAN_OFFSET_NO_EXT;

	if (ch < 36 || ch > 177) {
		valid = 0;
		goto exit;
	}

	switch (ch) {
	case 36:
	case 44:
	case 52:
	case 60:
	case 100:
	case 108:
	case 116:
	case 124:
	case 132:
	case 140:
	case 149:
	case 157:
	case 165:
	case 173:
		if (bw >= CHANNEL_WIDTH_40 && bw <= CHANNEL_WIDTH_160)
			offset = CHAN_OFFSET_UPPER;
		break;
	case 40:
	case 48:
	case 56:
	case 64:
	case 104:
	case 112:
	case 120:
	case 128:
	case 136:
	case 144:
	case 153:
	case 161:
	case 169:
	case 177:
		if (bw >= CHANNEL_WIDTH_40 && bw <= CHANNEL_WIDTH_160)
			offset = CHAN_OFFSET_LOWER;
		break;
	default:
		valid = 0;
		break;
	}

exit:
	if (valid && r_offset)
		*r_offset = offset;
	return valid;
}
#endif

#if CONFIG_IEEE80211_BAND_6GHZ
static u8 rtw_get_offset_by_chbw_6g(u8 ch, u8 bw, u8 *r_offset)
{
	if (ch >= 1 && ch <= 253) {
		u8 mod8 = ch % 8;

		if (mod8 == 1) {
			if (bw == CHANNEL_WIDTH_20)
				*r_offset = CHAN_OFFSET_NO_EXT;
			else
				*r_offset = CHAN_OFFSET_UPPER;
			return 1;
		}
		if (mod8 == 5) {
			if (bw == CHANNEL_WIDTH_20)
				*r_offset = CHAN_OFFSET_NO_EXT;
			else
				*r_offset = CHAN_OFFSET_LOWER;
			return 1;
		}
	}

	return 0;
}
#endif

u8 rtw_get_offset_by_bchbw(enum band_type band, u8 ch, u8 bw, u8 *r_offset)
{
	if (band == BAND_ON_24G) {
		u8 offset[1] = {r_offset ? *r_offset : CHAN_OFFSET_NO_EXT};
		u8 ret = rtw_get_offsets_by_chbw_2g(ch, bw, offset, NULL);

		if (ret && r_offset)
			*r_offset = offset[0];
		return ret;
	}
#if CONFIG_IEEE80211_BAND_5GHZ
	else if (band == BAND_ON_5G)
		return rtw_get_offset_by_chbw_5g(ch, bw, r_offset);
#endif
#if CONFIG_IEEE80211_BAND_6GHZ
	else if (band == BAND_ON_6G)
		return rtw_get_offset_by_chbw_6g(ch, bw, r_offset);
#endif
	return 0;
}

#if CONFIG_ALLOW_FUNC_2G_5G_ONLY
RTW_FUNC_2G_5G_ONLY u8 rtw_get_offset_by_chbw(u8 ch, u8 bw, u8 *r_offset)
{
	return rtw_get_offset_by_bchbw(rtw_is_2g_ch(ch) ? BAND_ON_24G : BAND_ON_5G, ch, bw, r_offset);
}
#endif

u8 rtw_get_offsets_by_bchbw(enum band_type band, u8 ch, u8 bw, u8 *r_offset, u8 *r_offset_num)
{
	u8 ret = 0;

	if (band == BAND_ON_24G)
		ret = rtw_get_offsets_by_chbw_2g(ch, bw, r_offset, r_offset_num);
#if CONFIG_IEEE80211_BAND_5GHZ
	else if (band == BAND_ON_5G) {
		ret = rtw_get_offset_by_chbw_5g(ch, bw, r_offset);
		if (ret && r_offset_num)
			*r_offset_num = 1;
	}
#endif
#if CONFIG_IEEE80211_BAND_6GHZ
	else if (band == BAND_ON_6G) {
		ret = rtw_get_offset_by_chbw_6g(ch, bw, r_offset);
		if (ret && r_offset_num)
			*r_offset_num = 1;
	}
#endif
	return ret;
}

static u8 rtw_get_center_ch_2g(u8 ch, u8 bw, u8 offset)
{
	u8 cch = ch;

	if (bw == CHANNEL_WIDTH_80) {
		/* special case for 2.4G */
		cch = 7;
	} else if (bw == CHANNEL_WIDTH_40) {
		if (offset == CHAN_OFFSET_UPPER)
			cch = ch + 2;
		else if (offset == CHAN_OFFSET_LOWER)
			cch = ch - 2;

	} else if (bw == CHANNEL_WIDTH_20
		|| bw == CHANNEL_WIDTH_10
		|| bw == CHANNEL_WIDTH_5
	)
		; /* same as ch */
	else
		rtw_warn_on(1);

	return cch;
}

#if CONFIG_IEEE80211_BAND_5GHZ
static u8 rtw_get_center_ch_5g(u8 ch, u8 bw, u8 offset)
{
	u8 cch = ch;

	if (bw == CHANNEL_WIDTH_160) {
		if (ch % 4 == 0) {
			if (ch >= 36 && ch <= 64)
				cch = 50;
			else if (ch >= 100 && ch <= 128)
				cch = 114;
		} else if (ch % 4 == 1) {
			if (ch >= 149 && ch <= 177)
				cch = 163;
		}

	} else if (bw == CHANNEL_WIDTH_80) {
		if (ch % 4 == 0) {
			if (ch >= 36 && ch <= 48)
				cch = 42;
			else if (ch >= 52 && ch <= 64)
				cch = 58;
			else if (ch >= 100 && ch <= 112)
				cch = 106;
			else if (ch >= 116 && ch <= 128)
				cch = 122;
			else if (ch >= 132 && ch <= 144)
				cch = 138;
		} else if (ch % 4 == 1) {
			if (ch >= 149 && ch <= 161)
				cch = 155;
			else if (ch >= 165 && ch <= 177)
				cch = 171;
		}

	} else if (bw == CHANNEL_WIDTH_40) {
		if (offset == CHAN_OFFSET_UPPER)
			cch = ch + 2;
		else if (offset == CHAN_OFFSET_LOWER)
			cch = ch - 2;

	} else if (bw == CHANNEL_WIDTH_20
		|| bw == CHANNEL_WIDTH_10
		|| bw == CHANNEL_WIDTH_5
	)
		; /* same as ch */
	else
		rtw_warn_on(1);

