MYiR-Dev/myir-imx-linux/drivers/staging/rtl8733bu/core/rtw_rf.c
	return cch;
}
#endif

#if CONFIG_IEEE80211_BAND_6GHZ
static u8 rtw_get_center_ch_6g(u8 ch, u8 bw, u8 offset)
{
	static const u8 start[CHANNEL_WIDTH_MAX] = {
		[CHANNEL_WIDTH_40] = 3,
		[CHANNEL_WIDTH_80] = 7,
		[CHANNEL_WIDTH_160] = 15,
	};
	static const u8 shift[CHANNEL_WIDTH_MAX] = {
		[CHANNEL_WIDTH_40] = 3,
		[CHANNEL_WIDTH_80] = 4,
		[CHANNEL_WIDTH_160] = 5,
	};
	u8 cch = ch;

	if (bw < CHANNEL_WIDTH_20 || bw > CHANNEL_WIDTH_160) {
		rtw_warn_on(1);
		goto exit;
	}

	if (bw == CHANNEL_WIDTH_20)
		goto exit;

	cch = (((ch - 1) >> shift[bw]) << shift[bw]) + start[bw];

exit:
	return cch;
}
#endif

u8 rtw_get_center_ch_by_band(enum band_type band, u8 ch, u8 bw, u8 offset)
{
	if (band == BAND_ON_24G)
		return rtw_get_center_ch_2g(ch, bw, offset);
#if CONFIG_IEEE80211_BAND_5GHZ
	else if (band == BAND_ON_5G)
		return rtw_get_center_ch_5g(ch, bw, offset);
#endif
#if CONFIG_IEEE80211_BAND_6GHZ
	else if (band == BAND_ON_6G)
		return rtw_get_center_ch_6g(ch, bw, offset);
#endif
	return 0;
}

#if CONFIG_ALLOW_FUNC_2G_5G_ONLY
RTW_FUNC_2G_5G_ONLY u8 rtw_get_center_ch(u8 ch, u8 bw, u8 offset)
{
	return rtw_get_center_ch_by_band(rtw_is_2g_ch(ch) ? BAND_ON_24G : BAND_ON_5G, ch, bw, offset);
}
#endif

/**
 * rtw_is_bchbw_grouped - test if the two ch settings can be grouped together
 * @band_a: band of set a
 * @ch_a: ch of set a
 * @bw_a: bw of set a
 * @offset_a: offset of set a
 * @band_b: band of set b
 * @ch_b: ch of set b
 * @bw_b: bw of set b
 * @offset_b: offset of set b
 */
bool _rtw_is_bchbw_grouped(enum band_type band_a, u8 ch_a, u8 bw_a, u8 offset_a
	, enum band_type band_b, u8 ch_b, u8 bw_b, u8 offset_b)
{
	bool is_grouped = _FALSE;

	if (band_a != band_b || ch_a != ch_b) {
		/* band/ch is different */
		goto exit;
	}

	if ((bw_a == CHANNEL_WIDTH_40 || bw_a == CHANNEL_WIDTH_80 || bw_a == CHANNEL_WIDTH_160)
		   && (bw_b == CHANNEL_WIDTH_40 || bw_b == CHANNEL_WIDTH_80 || bw_b == CHANNEL_WIDTH_160)
	) {
		if (offset_a != offset_b)
			goto exit;
	}

	is_grouped = _TRUE;

exit:
	return is_grouped;
}

#if CONFIG_ALLOW_FUNC_2G_5G_ONLY
RTW_FUNC_2G_5G_ONLY bool rtw_is_chbw_grouped(u8 ch_a, u8 bw_a, u8 offset_a, u8 ch_b, u8 bw_b, u8 offset_b)
{
	enum band_type band = BAND_ON_24G; /* unknown band, use same band for a & b */

	return _rtw_is_bchbw_grouped(band, ch_a, bw_a, offset_a, band, ch_b, bw_b, offset_b);
}
#endif

bool rtw_is_bchbw_grouped(enum band_type band_a, u8 ch_a, u8 bw_a, u8 offset_a
	, enum band_type band_b, u8 ch_b, u8 bw_b, u8 offset_b)
{
	return _rtw_is_bchbw_grouped(band_a, ch_a, bw_a, offset_a, band_b, ch_b, bw_b, offset_b);
}

/**
 * rtw_sync_bchbw - obey g_band, g_ch, adjust g_bw, g_offset, bw, offset
 * @req_band: pointer of the request band, may be modified further
 * @req_ch: pointer of the request ch, may be modified further
 * @req_bw: pointer of the request bw, may be modified further
 * @req_offset: pointer of the request offset, may be modified further
 * @g_band: pointer of the ongoing group band
 * @g_ch: pointer of the ongoing group ch
 * @g_bw: pointer of the ongoing group bw, may be modified further
 * @g_offset: pointer of the ongoing group offset, may be modified further
 */
void _rtw_sync_bchbw(enum band_type *req_band, u8 *req_ch, u8 *req_bw, u8 *req_offset
	, enum band_type *g_band, u8 *g_ch, u8 *g_bw, u8 *g_offset)
{
	*req_band = *g_band;
	*req_ch = *g_ch;

	if (*req_bw == CHANNEL_WIDTH_80 && *g_band == BAND_ON_24G) {
		/*2.4G ch, downgrade to 40Mhz */
		*req_bw = CHANNEL_WIDTH_40;
	}

	switch (*req_bw) {
	case CHANNEL_WIDTH_160:
	case CHANNEL_WIDTH_80:
	case CHANNEL_WIDTH_40:
		if (*g_bw == CHANNEL_WIDTH_40 || *g_bw == CHANNEL_WIDTH_80 || *g_bw == CHANNEL_WIDTH_160)
			*req_offset = *g_offset;
		else if (*g_bw == CHANNEL_WIDTH_20)
			rtw_get_offset_by_bchbw(*req_band, *req_ch, *req_bw, req_offset);

		if (*req_offset == CHAN_OFFSET_NO_EXT) {
			RTW_ERR("%s req %s BW without offset, down to 20MHz\n", __func__, ch_width_str(*req_bw));
			rtw_warn_on(1);
			*req_bw = CHANNEL_WIDTH_20;
		}
		break;
	case CHANNEL_WIDTH_20:
		*req_offset = CHAN_OFFSET_NO_EXT;
		break;
	default:
		RTW_ERR("%s req unsupported BW:%u\n", __func__, *req_bw);
		rtw_warn_on(1);
	}

	if (*req_bw > *g_bw) {
		*g_bw = *req_bw;
		*g_offset = *req_offset;
	}
}

#if CONFIG_ALLOW_FUNC_2G_5G_ONLY
RTW_FUNC_2G_5G_ONLY void rtw_sync_chbw(u8 *req_ch, u8 *req_bw, u8 *req_offset, u8 *g_ch, u8 *g_bw, u8 *g_offset)
{
	enum band_type band = rtw_is_2g_ch(*g_ch) ? BAND_ON_24G : BAND_ON_5G; /* follow g_ch's band */

	_rtw_sync_bchbw(&band, req_ch, req_bw, req_offset, &band, g_ch, g_bw, g_offset);
}
#endif

void rtw_sync_bchbw(enum band_type *req_band, u8 *req_ch, u8 *req_bw, u8 *req_offset
	, enum band_type *g_band, u8 *g_ch, u8 *g_bw, u8 *g_offset)
{
	_rtw_sync_bchbw(req_band, req_ch, req_bw, req_offset, g_band, g_ch, g_bw, g_offset);
}

static int rtw_ch2freq_2g(int ch)
{
	if (ch >= 1 && ch <= 14) {
		if (ch == 14)
			return 2484;
		else if (ch < 14)
			return 2407 + ch * 5;
	}

	return 0; /* not supported */
}

#if CONFIG_IEEE80211_BAND_5GHZ
static int rtw_ch2freq_5g(int ch)
{
	if (ch >= 36 && ch <= 177)
		return 5000 + ch * 5;

	return 0; /* not supported */
}
#endif

#if CONFIG_IEEE80211_BAND_6GHZ
static int rtw_ch2freq_6g(int ch)
{
	if (ch >= 1 && ch <= 253)
		return 5950 + ch * 5;

	return 0; /* not supported */
}
#endif

int rtw_bch2freq(enum band_type band, int ch)
{
	if (band == BAND_ON_24G)
		return rtw_ch2freq_2g(ch);
#if CONFIG_IEEE80211_BAND_5GHZ
	else if (band == BAND_ON_5G)
		return rtw_ch2freq_5g(ch);
#endif
#if CONFIG_IEEE80211_BAND_6GHZ
	else if (band == BAND_ON_6G)
		return rtw_ch2freq_6g(ch);
#endif
	return 0;
}

#if CONFIG_ALLOW_FUNC_2G_5G_ONLY
RTW_FUNC_2G_5G_ONLY int rtw_ch2freq(int ch)
{
	return rtw_bch2freq(rtw_is_2g_ch(ch) ? BAND_ON_24G : BAND_ON_5G, ch);
}
#endif

int rtw_freq2ch(int freq)
{
	/* see 802.11 17.3.8.3.2 and Annex J */
	if (freq == 2484)
		return 14;
	else if (freq < 2484)
		return (freq - 2407) / 5;
	else if (freq >= 4910 && freq <= 4980)
		return (freq - 4000) / 5;
	else if (freq >= 5000 && freq < 5950)
		return (freq - 5000) / 5;
	else if (freq >= 5950 && freq <= 7215)
		return (freq - 5950) / 5;
	else if (freq >= 58320 && freq <= 64800)
		return (freq - 56160) / 2160;
	else
		return 0;
}

enum band_type rtw_freq2band(int freq)
{
	if (freq <= 2484)
		return BAND_ON_24G;
#if CONFIG_IEEE80211_BAND_5GHZ
	else if (freq >= 5000 && freq < 5950)
		return BAND_ON_5G;
#endif
#if CONFIG_IEEE80211_BAND_6GHZ
	else if (freq >= 5950 && freq <= 7215)
		return BAND_ON_6G;
#endif
	else
		return BAND_MAX;
}

